app/views/stadia/show.html.erb

<ul>
	<% @stadium.vendors.each do |vendor| %>
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."stadium_id" = 12