app/controllers/application_controller.rb

SELECT "vendors".* FROM "vendors"
---
	def select_vendor
    @loc = Location.find(params[:object_id])
    if @loc.instance_of?(Restaurant)
      redirect_to new_order_path(:restaurant_id => @loc.id)
    else
  		@stadium = Stadium.find(params[:object_id])
  		@vendors = Vendor.all

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "2"]]
---
	def select_items
		@vendor = Vendor.find(params[:object_id])