app/controllers/vendors_controller.rb

	def add_item
		vendor = Vendor.find(params[:item][:vendor_id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "2"]]