app/controllers/vendors_controller.rb

	def index
		@vendors = Vendor.where(:stadium_id => @stadium.id)
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."stadium_id" = 1

	def edit
		@vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "2"]]

	def create
		vendor = @stadium.vendors.new(params[:vendor])
		vendor.build_menu
		vendor.save
---
INSERT INTO "menus" ("created_at", "updated_at", "vendor_id") VALUES (?, ?, ?)  [["created_at", Thu, 17 Oct 2013 19:00:13 UTC +00:00], ["updated_at", Thu, 17 Oct 2013 19:00:13 UTC +00:00], ["vendor_id", 7]]
INSERT INTO "vendors" ("created_at", "name", "stadium_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 17 Oct 2013 09:29:19 UTC +00:00], ["name", "abc"], ["stadium_id", 1], ["updated_at", Thu, 17 Oct 2013 09:29:19 UTC +00:00]]

	def destroy
		@vendor.destroy
---
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 1]]

	def add_item
		category = Category.find(params[:item][:category_id])
		category.items.create(params[:item][:name], params[:item][:price], params[:item][:item_type], params[:item][:requires_id], params[:item][:nut_allergy], params[:item][:vegetarian])
---
INSERT INTO "items" ("created_at", "menu_id", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 17 Oct 2013 16:42:10 UTC +00:00], ["menu_id", 1], ["name", "abc"], ["price", #<BigDecimal:7fc68cc375d0,'0.12E1',18(18)>], ["updated_at", Thu, 17 Oct 2013 16:42:10 UTC +00:00]]