app/views/application/select_items.html.erb

		</tr>
		<% @vendor.menu.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."menu_id" = 1
SELECT "menus".* FROM "menus" WHERE "menus"."vendor_id" = 2 LIMIT 1