app/views/application/select_vendor.html.erb

<ul>
	<% @stadium.vendors.each do |vendor| %>
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."stadium_id" = 1